<!DOCTYPE html>
<html lang="ru-UA">
<head>
    <meta charset="UTF-8"/>
    <title>Фалалеев Александр: Резюме</title>
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootswatch/3.3.1/united/bootstrap.min.css">
    <link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap-theme.min.css">
    <style>
        ul > li { margin-top: 10px; }
    </style>
</head>
<body>
<div class="container">
    <div class="row">
        <div class="col-xs-6 col-xs-offset-3">

            <h1>Фалалеев Александр</h1>

            <dl class="dl-horizontal">
                <dt>ФИО</dt><dd>Фалалеев Александр Николаевич</dd>
                <dt>Дата рождения</dt><dd>15 декабря 1987г.</dd>
                <dt>Место проживания</dt><dd>Украина, г. Киев, ул Архитектора Вербицкого, д. 24</dd>
                <dt>Телефон</dt><dd>+380 (68) 870-14-16</dd>
                <dt>E-mail</dt><dd><a href="mailto:sartorua@gmail.com">sartorua@gmail.com</a></dd>
                <dt>Skype</dt><dd>SartorUA</dd>
                <dt>Образование</dt><dd>ВНУ им. Даля, красный диплом магистра (2010г.)</dd>
                <dt>Специальность</dt><dd>Системы управления и автоматика</dd>
            </dl>

            <h2>О себе</h2>

            <ul>
                <li>Хорошо знаю письменный английский (особенно технический), плохо говорю, но понимаю устный. Часто смотрю фильмы и лекции на английском.
                <li>Для разработки использую Linux Mint, Sublime Text, PHPStorm, Adminer
                <li>Люблю красивый код, рефакторинг. Соответствую требуемому Code Style.
                <li>Быстро обучаюсь новшествам, постоянно пробую новые технологии, инструменты, подходы, принципы.
                <li>Люблю активный отдых, велосипед, настольные игры (сложные, чтобы вскипал мозг), теннис, научные исследования
                <li>Слабые стороны: мало опыта коллективной разработки, не люблю дресс-код
            </ul>

            <h2>Хочу</h2>

            <ul>
                <li>Должность Middle PHP developer
                <li>Работать 40 часов в неделю (можно строгий график)
                <li>Разрабатывать интересный реальный проект, влиять на его будущее
                <li>Обмениваться опытом с коллегами, взаимодействовать вне рабочего процесса (конференции, спорт, отдых)
                <li>Получать <strong>1500$</strong> в гривнах с привязкой к курсу.
            </ul>

            <h2>Опыт использования технологий</h2>

            <ul>
                <li><strong>PHP</strong> - 5 лет, знаю и использую (по возможности) новшества PHP 5.5+
                <li><strong>MySQL</strong> - 6 лет, умею писать сложные, очень сложные и быстрые запросы, делать денормализацию для узких мест. Пишу хранимые процедуры, правильные индексы. Разработка архитектуры, проектирование баз данных под реальные процессы (бизнес, производство, транспорт)
                <li><strong>HTML5, СSS3, JS</strong> - средний уровень знаний, плохо верстаю
                <li><strong>PCRE</strong> - пишу быстрые и сложные регулярные выражения
                <li><strong>Linux</strong> администрирование - 4 года. Для работы использую Linux Mint, большой опыт разворачивания VDS (Ubuntu-подобные системы, немного FreeBSD), дружу с командной строкой и консольными утилитами
                <li>Фреймворки:
                    <ul>
                        <li><strong>Kohana 3.0-3.3</strong> - 3 года использования, написание модулей, багрепортинг на форуме, по сути есть своя CMS на этом фреймворке
                        <li><strong>Twitter Bootstrap</strong> - 1.5 года использования
                        <li><strong>jQuery 1.2.4-2.1</strong> - 4 года, умелое использование (только когда действительно нужно)
                        <li><strong>Yii2</strong> - 3 месяца
                    </ul>
                <li>Разное: AJAX, REST, немного SOAP, Lua-PHP, ActiveRecord, QueryBuilder, MVC (HMVC), Composer, Git, SVN (давно не использовал),
            </ul>

            <h2>Процесс становления программистом</h2>

            <ul>
                <li>В 8 лет начал баловаться на BASIC на компьютере ZX-Spectrum
                <li>С 10 лет Visual Basic и Borland С++ Builder, делал мелкие игрушки, геометрические рисовалки
                <li>Первая полезная программа была написана для решения матриц (системы линейных уравнений) разными методами с промежуточными шагами в 11 классе (поехала на городскую олимпиаду, но ничего не выиграла)
                <li>В университете писал много прикладных программ (электромагнитные расчёты, тесты внимательности для военных пилотов, задачи логистики). По многим были научные статьи по собранной статистике
                <li>С Web-ом познакомился в 2008 году, совместно делал сайт кафедры, разработал систему тестирования по СУБД для студентов (пользуются до сих пор)
                <li>С 2009 по 2013 в компании GrandIT (<a href="http://grandit.com.ua/portfolio/development/">Портфолио компании</a>) занимался:
                    <ul>
                        <li>Полный рефакторинг, доработка, техподдержка, разработка новшеств к онлайн-игре <a href="http://experimentum.ru/">experimentum.ru</a>. Проект медленно умирал с связи с полным отсутствием финансирования.
                        <li>Доработкой дичайше старых туристических сайтов для выкачивания из них последних соков рекламой
                        <li>Разработка нескольких модулей для нашей внутренней CMS
                    </ul>
                <li>С 2012 по 2014 разработал и поддерживал крупный интернет-магазин (<a href="http://koleso2000.ua/">Колесо 2000</a>). Основые занятия:
                    <ul>
                        <li>Проектирование архитектуры и реализация с нуля на фреймворке <a href="https://kohanaframework.org/">Kohana</a> бекенда и фронтенда сайта (всё, кроме дизайна и вёрстки)
                        <li>Плотная двухсторонняя интеграция с 1С, использование многих сторонних сервисов
                        <li>Многопоточный парсинг прайс-агрегаторов и конкурентов, импорт и совмещение разных прайсов
                        <li>Бекенд разработан с учётом разделения труда менеджерского состава
                    </ul>
                <li>С 2010 по 2014 много мелких сайтов, которые, наверное, не стоят внимания. Некоторые: <a href="http://randigkatt.se/">randigkatt.se</a>, <a href="http://bg.lg.ua/">bg.lg.ua</a>, <a href="http://zolotuhiny.lg.ua/">zolotuhiny.lg.ua</a>, <a href="http://euromix.ua/">euromix.ua</a>
            </ul>

        </div>
    </div>
</div>
</body>
</html>
